       01  DB-CONNECT-PARAMS.
           05  DB-SERVER           PIC X(50).
           05  DB-PORT             PIC X(5).
           05  DB-DATABASE         PIC X(50).
           05  DB-UID              PIC X(50).
           05  DB-PWD              PIC X(50).
