01  fcgx-in-handle  usage pointer.
01  fcgx-out-handle usage pointer.
01  fcgx-err-handle usage pointer.
01  fcgx-envp       usage pointer.

01  crlf.
    05  cr pic x value x'0d'.
    05  lf pic x value x'0a'.
